zlgopen/ametal/soc/hdsc/drivers/include/dma/hw/amhw_hc32f460_dma.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg118.cn/
*******************************************************************************/

/**
 * \file
 * \brief DMA hardware operation interface.
 *
 * 1. 2 independent programmable DMA channel.
 * 2. 8,16,32 bits data to transfer.
 * 3. support programmable source address,destination address and data size。
 *
 * 存在一个 硬件配置项： AMHW_HC32F460_DMA_CHAN_CNT。用以配置 DMA通道数目，使用本文件时，
 * 应在 soc_cfg.h 文件中定义该宏。
 *
 * \internal
 * \par Modification history
 * - 1.00 20-03-04  cds, first implementation
 * \endinternal
 */

#ifndef __AMHW_HC32F460_DMA_H
#define __AMHW_HC32F460_DMA_H

#ifdef __cplusplus
extern "C" {
#endif

#include "am_types.h"
#include "am_common.h"
#include "am_vdebug.h"
#include "hc32f460_dma_chan.h"
#include "hc32f460_regbase.h"
/**
 * \addtogroup amhw_hc32f460_if_dma
 * \copydoc amhw_hc32f460_dma.h
 * @{
 */

/** \brief DMA 通道数目  */
#define AMHW_HC32F460_DMA_CHAN_CNT  4

#define AMHW_HC32F460_DMA_DTCTL_CNT_MAX         (0XFFFFUL)
#define AMHW_HC32F460_DMA_DTCTL_BLKSIZE_MAX     (1024UL)
#define AMHW_HC32F460_DMA_RPT_DRPT_MAX          (0X3FFUL)
#define AMHW_HC32F460_DMA_RPT_SRPT_MAX          (0X3FFUL)
#define AMHW_HC32F460_DMA_SNSEQCTL_SNSCNT_MAX   (0XFFFUL)
#define AMHW_HC32F460_DMA_SNSEQCTL_SOFFSET_MAX  (0XFFFFFUL)
#define AMHW_HC32F460_DMA_DNSEQCTL_DNSCNT_MAX   (0XFFFUL)
#define AMHW_HC32F460_DMA_DNSEQCTL_DSOFFSET_MAX (0XFFFFFUL)

#define AMHW_HC32F460_DMA_DTCTL_CNT_SHIFT        (16UL)
#define AMHW_HC32F460_DMA_RPT_DRPT_SHIFT         (16UL)
#define AMHW_HC32F460_DMA_SNSEQCTL_SNSCNT_SHIFT  (20UL)
#define AMHW_HC32F460_DMA_DNSEQCTL_DNSCNT_SHIFT  (20UL)

#define AMHW_HC32F460_DMA_RCFGCTL_CNTMD_SHIFT    (20UL)
#define AMHW_HC32F460_DMA_RCFGCTL_DARMD_SHIFT    (18UL)
#define AMHW_HC32F460_DMA_RCFGCTL_SARMD_SHIFT    (16UL)
#define AMHW_HC32F460_DMA_RCFGCTL_RCFGCHS_SHIFT  (8UL)
#define AMHW_HC32F460_DMA_RCFGCTL_RCFGLLP_SHIFT  (1UL)
#define AMHW_HC32F460_DMA_RCFGCTL_RCFGEN_SHIFT   (0UL)

typedef struct
{
    __IO uint32_t EN                        : 1;
    uint32_t RESERVED1                      :31;
} stc_dma_en_field_t;

typedef struct
{
    __IO uint32_t TRNERR                    : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t REQERR                    : 4;
    uint32_t RESERVED20                     :12;
} stc_dma_intstat0_field_t;

typedef struct
{
    __IO uint32_t TC                        : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t BTC                       : 4;
    uint32_t RESERVED20                     :12;
} stc_dma_intstat1_field_t;

typedef struct
{
    __IO uint32_t MSKTRNERR                 : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t MSKREQERR                 : 4;
    uint32_t RESERVED20                     :12;
} stc_dma_intmask0_field_t;

typedef struct
{
    __IO uint32_t MSKTC                     : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t MSKBTC                    : 4;
    uint32_t RESERVED20                     :12;
} stc_dma_intmask1_field_t;

typedef struct
{
    __IO uint32_t CLRTRNERR                 : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t CLRREQERR                 : 4;
    uint32_t RESERVED20                     :12;
} stc_dma_intclr0_field_t;

typedef struct
{
    __IO uint32_t CLRTC                     : 4;
    uint32_t RESERVED4                      :12;
    __IO uint32_t CLRBTC                    : 4;
    uint32_t RESERVED20                     :12;
} stc_dma_intclr1_field_t;

typedef struct
{
    __IO uint32_t CHEN                      : 4;
    uint32_t RESERVED4                      :28;
} stc_dma_chen_field_t;

typedef struct
{
    __IO uint32_t DMAACT                    : 1;
    __IO uint32_t RCFGACT                   : 1;
    uint32_t RESERVED2                      :14;
    __IO uint32_t CHACT                     : 4;
    uint32_t RESERVED20                     :12;
} stc_dma_chstat_field_t;

typedef struct
{
    __IO uint32_t RCFGEN                    : 1;
    __IO uint32_t RCFGLLP                   : 1;
    uint32_t RESERVED2                      : 6;
    __IO uint32_t RCFGCHS                   : 4;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t SARMD                     : 2;
    __IO uint32_t DARMD                     : 2;
    __IO uint32_t CNTMD                     : 2;
    uint32_t RESERVED22                     :10;
} stc_dma_rcfgctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dma_dtctl_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
    uint32_t RESERVED26                     : 6;
} stc_dma_rpt_field_t;

typedef struct
{
    __IO uint32_t SRPTB                     :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPTB                     :10;
    uint32_t RESERVED26                     : 6;
} stc_dma_rptb_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dma_snseqctl_field_t;

typedef struct
{
    __IO uint32_t SNSDIST                   :20;
    __IO uint32_t SNSCNTB                   :12;
} stc_dma_snseqctlb_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dma_dnseqctl_field_t;

typedef struct
{
    __IO uint32_t DNSDIST                   :20;
    __IO uint32_t DNSCNTB                   :12;
} stc_dma_dnseqctlb_field_t;

typedef struct
{
    uint32_t RESERVED0                      : 2;
    __IO uint32_t LLP                       :30;
} stc_dma_llp_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    uint32_t RESERVED13                     :19;
} stc_dma_ch0ctl_field_t;

typedef struct
{
    __IO uint32_t BLKSIZE                   :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t CNT                       :16;
} stc_dma_mondtctl_field_t;

typedef struct
{
    __IO uint32_t SRPT                      :10;
    uint32_t RESERVED10                     : 6;
    __IO uint32_t DRPT                      :10;
    uint32_t RESERVED26                     : 6;
} stc_dma_monrpt_field_t;

typedef struct
{
    __IO uint32_t SOFFSET                   :20;
    __IO uint32_t SNSCNT                    :12;
} stc_dma_monsnseqctl_field_t;

typedef struct
{
    __IO uint32_t DOFFSET                   :20;
    __IO uint32_t DNSCNT                    :12;
} stc_dma_mondnseqctl_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    uint32_t RESERVED13                     :19;
} stc_dma_ch1ctl_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    uint32_t RESERVED13                     :19;
} stc_dma_ch2ctl_field_t;

typedef struct
{
    __IO uint32_t SINC                      : 2;
    __IO uint32_t DINC                      : 2;
    __IO uint32_t SRTPEN                    : 1;
    __IO uint32_t DRPTEN                    : 1;
    __IO uint32_t SNSEQEN                   : 1;
    __IO uint32_t DNSEQEN                   : 1;
    __IO uint32_t HSIZE                     : 2;
    __IO uint32_t LLPEN                     : 1;
    __IO uint32_t LLPRUN                    : 1;
    __IO uint32_t IE                        : 1;
    uint32_t RESERVED13                     :19;
} stc_dma_ch3ctl_field_t;

/**
 * \brief structure of DMA controller register
 */
typedef struct amhw_hc32f460_dma_chan {
    union
    {   /* DMA使能寄存器 */
        __IO uint32_t EN;
        stc_dma_en_field_t EN_f;
    };
    union
    {   /* 中断状态寄存器0 */
        __IO uint32_t INTSTAT0;
        stc_dma_intstat0_field_t INTSTAT0_f;
    };
    union
    {   /* 中断状态寄存器1 */
        __IO uint32_t INTSTAT1;
        stc_dma_intstat1_field_t INTSTAT1_f;
    };
    union
    {   /* 中断屏蔽寄存器0 */
        __IO uint32_t INTMASK0;
        stc_dma_intmask0_field_t INTMASK0_f;
    };
    union
    {   /* 中断屏蔽寄存器1 */
        __IO uint32_t INTMASK1;
        stc_dma_intmask1_field_t INTMASK1_f;
    };
    union
    {   /* 中断复位寄存器0 */
        __IO uint32_t INTCLR0;
        stc_dma_intclr0_field_t INTCLR0_f;
    };
    union
    {   /* 中断复位寄存器1 */
        __IO uint32_t INTCLR1;
        stc_dma_intclr1_field_t INTCLR1_f;
    };
    union
    {   /* 通道使能寄存器 */
        __IO uint32_t CHEN;
        stc_dma_chen_field_t CHEN_f;
    };
    uint8_t RESERVED8[4];
    union
    {   /* 传输中通道监视寄存器 */
        __IO uint32_t CHSTAT;
        stc_dma_chstat_field_t CHSTAT_f;
    };
    uint8_t RESERVED9[4];
    union
    {   /* 通道重置控制寄存器 */
        __IO uint32_t RCFGCTL;
        stc_dma_rcfgctl_field_t RCFGCTL_f;
    };
    uint8_t RESERVED10[16];
    /* 传输源地址寄存器 */
    __IO uint32_t SAR0;
    /* 传输目标地址寄存器 */
    __IO uint32_t DAR0;
    union
    {   /* 数据控制寄存器 */
        __IO uint32_t DTCTL0;
        stc_dma_dtctl_field_t DTCTL0_f;
    };
    union
    {   /* 重复区域大小寄存器 */
        __IO uint32_t RPT0;
        stc_dma_rpt_field_t RPT0_f;
        /* 重复区域大小寄存器B */
        __IO uint32_t RPTB0;
        stc_dma_rptb_field_t RPTB0_f;
    };
    union
    {
        /* 源设备不连续地址传输控制寄存器 */
        __IO uint32_t SNSEQCTL0;
        stc_dma_snseqctl_field_t SNSEQCTL0_f;
        /* 源设备不连续地址传输控制寄存器B */
        __IO uint32_t SNSEQCTLB0;
        stc_dma_snseqctlb_field_t SNSEQCTLB0_f;
    };
    union
    {
        /* 目标设备不连续地址传输控制寄存器 */
        __IO uint32_t DNSEQCTL0;
        stc_dma_dnseqctl_field_t DNSEQCTL0_f;
        /* 目标设备不连续地址传输控制寄存器B */
        __IO uint32_t DNSEQCTLB0;
        stc_dma_dnseqctlb_field_t DNSEQCTLB0_f;
    };
    union
    {   /* 链指针寄存器 */
        __IO uint32_t LLP0;
        stc_dma_llp_field_t LLP0_f;
    };
    union
    {   /* 通道控制寄存器 */
        __IO uint32_t CH0CTL;
        stc_dma_ch0ctl_field_t CH0CTL_f;
    };
    __IO uint32_t MONSAR0;
    __IO uint32_t MONDAR0;
    union
    {
        __IO uint32_t MONDTCTL0;
        stc_dma_mondtctl_field_t MONDTCTL0_f;
    };
    union
    {
        __IO uint32_t MONRPT0;
        stc_dma_monrpt_field_t MONRPT0_f;
    };
    union
    {
        __IO uint32_t MONSNSEQCTL0;
        stc_dma_monsnseqctl_field_t MONSNSEQCTL0_f;
    };
    union
    {
        __IO uint32_t MONDNSEQCTL0;
        stc_dma_mondnseqctl_field_t MONDNSEQCTL0_f;
    };
    uint8_t RESERVED27[8];
    __IO uint32_t SAR1;
    __IO uint32_t DAR1;
    union
    {
        __IO uint32_t DTCTL1;
        stc_dma_dtctl_field_t DTCTL1_f;
    };
    union
    {
        __IO uint32_t RPT1;
        stc_dma_rpt_field_t RPT1_f;
        __IO uint32_t RPTB1;
        stc_dma_rptb_field_t RPTB1_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL1;
        stc_dma_snseqctl_field_t SNSEQCTL1_f;
        __IO uint32_t SNSEQCTLB1;
        stc_dma_snseqctlb_field_t SNSEQCTLB1_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL1;
        stc_dma_dnseqctl_field_t DNSEQCTL1_f;
        __IO uint32_t DNSEQCTLB1;
        stc_dma_dnseqctlb_field_t DNSEQCTLB1_f;
    };
    union
    {
        __IO uint32_t LLP1;
        stc_dma_llp_field_t LLP1_f;
    };
    union
    {
        __IO uint32_t CH1CTL;
        stc_dma_ch1ctl_field_t CH1CTL_f;
    };
    __IO uint32_t MONSAR1;
    __IO uint32_t MONDAR1;
    union
    {
        __IO uint32_t MONDTCTL1;
        stc_dma_mondtctl_field_t MONDTCTL1_f;
    };
    union
    {
        __IO uint32_t MONRPT1;
        stc_dma_monrpt_field_t MONRPT1_f;
    };
    union
    {
        __IO uint32_t MONSNSEQCTL1;
        stc_dma_monsnseqctl_field_t MONSNSEQCTL1_f;
    };
    union
    {
        __IO uint32_t MONDNSEQCTL1;
        stc_dma_mondnseqctl_field_t MONDNSEQCTL1_f;
    };
    uint8_t RESERVED44[8];
    __IO uint32_t SAR2;
    __IO uint32_t DAR2;
    union
    {
        __IO uint32_t DTCTL2;
        stc_dma_dtctl_field_t DTCTL2_f;
    };
    union
    {
        __IO uint32_t RPT2;
        stc_dma_rpt_field_t RPT2_f;
        __IO uint32_t RPTB2;
        stc_dma_rptb_field_t RPTB2_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL2;
        stc_dma_snseqctl_field_t SNSEQCTL2_f;
        __IO uint32_t SNSEQCTLB2;
        stc_dma_snseqctlb_field_t SNSEQCTLB2_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL2;
        stc_dma_dnseqctl_field_t DNSEQCTL2_f;
        __IO uint32_t DNSEQCTLB2;
        stc_dma_dnseqctlb_field_t DNSEQCTLB2_f;
    };
    union
    {
        __IO uint32_t LLP2;
        stc_dma_llp_field_t LLP2_f;
    };
    union
    {
        __IO uint32_t CH2CTL;
        stc_dma_ch2ctl_field_t CH2CTL_f;
    };
    __IO uint32_t MONSAR2;
    __IO uint32_t MONDAR2;
    union
    {
        __IO uint32_t MONDTCTL2;
        stc_dma_mondtctl_field_t MONDTCTL2_f;
    };
    union
    {
        __IO uint32_t MONRPT2;
        stc_dma_monrpt_field_t MONRPT2_f;
    };
    union
    {
        __IO uint32_t MONSNSEQCTL2;
        stc_dma_monsnseqctl_field_t MONSNSEQCTL2_f;
    };
    union
    {
        __IO uint32_t MONDNSEQCTL2;
        stc_dma_mondnseqctl_field_t MONDNSEQCTL2_f;
    };
    uint8_t RESERVED61[8];
    __IO uint32_t SAR3;
    __IO uint32_t DAR3;
    union
    {
        __IO uint32_t DTCTL3;
        stc_dma_dtctl_field_t DTCTL3_f;
    };
    union
    {
        __IO uint32_t RPT3;
        stc_dma_rpt_field_t RPT3_f;
        __IO uint32_t RPTB3;
        stc_dma_rptb_field_t RPTB3_f;
    };
    union
    {
        __IO uint32_t SNSEQCTL3;
        stc_dma_snseqctl_field_t SNSEQCTL3_f;
        __IO uint32_t SNSEQCTLB3;
        stc_dma_snseqctlb_field_t SNSEQCTLB3_f;
    };
    union
    {
        __IO uint32_t DNSEQCTL3;
        stc_dma_dnseqctl_field_t DNSEQCTL3_f;
        __IO uint32_t DNSEQCTLB3;
        stc_dma_dnseqctlb_field_t DNSEQCTLB3_f;
    };
    union
    {
        __IO uint32_t LLP3;
        stc_dma_llp_field_t LLP3_f;
    };
    union
    {
        __IO uint32_t CH3CTL;
        stc_dma_ch3ctl_field_t CH3CTL_f;
    };
    __IO uint32_t MONSAR3;
    __IO uint32_t MONDAR3;
    union
    {
        __IO uint32_t MONDTCTL3;
        stc_dma_mondtctl_field_t MONDTCTL3_f;
    };
    union
    {
        __IO uint32_t MONRPT3;
        stc_dma_monrpt_field_t MONRPT3_f;
    };
    union
    {
        __IO uint32_t MONSNSEQCTL3;
        stc_dma_monsnseqctl_field_t MONSNSEQCTL3_f;
    };
    union
    {
        __IO uint32_t MONDNSEQCTL3;
        stc_dma_mondnseqctl_field_t MONDNSEQCTL3_f;
    };
} amhw_hc32f460_dma_t;


/**
 * \brief DMA transfer mode select
 */
typedef enum {
    AMHW_HC32F460_DMA_PER_TO_MER,     /**< \brief DMA peripheral to memory mode */
    AMHW_HC32F460_DMA_MER_TO_PER,     /**< \brief DMA memory to peripheral mode */
    AMHW_HC32F460_DMA_MER_TO_MER,     /**< \brief DMA memory to memory mode */
    AMHW_HC32F460_DMA_PER_TO_PER      /**< \brief DMA peripheral to peripheral mode */
} amhw_hc32f460_dma_transfer_type_t;


/**
 * \brief DMA descriptor
 */
typedef struct amhw_hc32f460_dma_xfer_desc {
    volatile uint32_t          xfercfg;        /**< \brief transfer configuration */
    volatile uint32_t          src_addr;       /**< \brief source address */
    volatile uint32_t          dst_addr;       /**< \brief destination address */
    volatile uint32_t          nbytes;         /**< \brief the bytes of data to transfer */
} amhw_hc32f460_dma_xfer_desc_t;

/**
 * \brief DMA chain transmission descriptor
 */
typedef struct amhw_hc32f460_dma_chain_xfer_desc {
    volatile uint32_t src_addr;       /**< \brief 源地址  */
    volatile uint32_t dst_addr;       /**< \brief 目标地址  */
    volatile uint32_t data_ctrl;      /**< \brief 数据控制寄存器  */
    volatile uint32_t rpt;            /**< \brief 重复区域大小寄存器  */
    volatile uint32_t snseqctl;       /**< \brief 源设备不连续地址传输控制寄存器  */
    volatile uint32_t dnseqctl;       /**< \brief 目标设备不连续地址传输控制寄存器  */
    volatile uint32_t llp;            /**< \brief 链指针寄存器  */
    volatile uint32_t ch_ctl;         /**< \brief 通道控制寄存器  */
} amhw_hc32f460_dma_chain_xfer_desc_t;

/**
 * \brief DMA 通道总使能控制位     使能
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_enable(amhw_hc32f460_dma_t *p_hw_dma)
{
    p_hw_dma->EN_f.EN = 0x01;
}

/**
 * \brief DMA 通道总使能控制位     禁能
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_disable(amhw_hc32f460_dma_t *p_hw_dma)
{
    p_hw_dma->EN_f.EN = 0x0;
}


/**
 * \brief DMA 通道状态标志位
 *@{
 */
typedef enum {
    AMHW_HC32F460_DMA_CHSTAT_DMAACT     = 0,               /* DMA动作监视位 */
    AMHW_HC32F460_DMA_CHSTAT_RCFGACT    = 1 ,              /* DMA通道重置动作中监视位 */
    AMHW_HC32F460_DMA_CHSTAT_CHACT      = 16,              /* 传输动作中通道监视位 */
}amhw_hc32f460_dma_trans_status_t;

/**
 * \brief DMA 所有通道的传输状态   获取
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 *
 * \note
 *
 * \return none
 */
am_static_inline
am_bool_t amhw_hc32f460_dma_transfer_check (amhw_hc32f460_dma_t             *p_hw_dma,
                                            uint8_t                          channel,
                                            amhw_hc32f460_dma_trans_status_t flag)
{
    if (flag == AMHW_HC32F460_DMA_CHSTAT_DMAACT) {
        /* DMA是否处于传输动作中 */
        return ((p_hw_dma->CHSTAT) & 0x1ul) ? AM_TRUE : AM_FALSE;
    } else if (flag == AMHW_HC32F460_DMA_CHSTAT_RCFGACT) {
        /* DMA是否处通道重置动作中 */
        return ((p_hw_dma->CHSTAT) & 0x2ul) ? AM_TRUE : AM_FALSE;
    } else if (flag == AMHW_HC32F460_DMA_CHSTAT_CHACT) {
        /* DMA对应通道是否处于动作中 */
        return (((p_hw_dma->CHSTAT) >> 16) & (1 << channel)) ? AM_TRUE : AM_FALSE;
    } else {
        return -AM_EINVAL;
    }
}


/**
 * \brief DMA 某一通道的使能控制位    使能
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 *
 * \note CHEN[3:0]每个位对应一个通道，使用该通道需将该位置1.传输过程中使能位保持为1，
 *       当传输完成次数寄存器DMA_DTCTLx.CNT设置的传输次数后将会自动清零。如果DMA_CTLx.CNT
 *       设置为0，则传输完成后不会自动清零，即无限次传输。
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_enable(amhw_hc32f460_dma_t *p_hw_dma,
                                   uint8_t              channel)
{
    p_hw_dma->CHEN_f.CHEN |= (1 << channel);
}

/**
 * \brief DMA 某一通道的使能控制位    禁能
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 *
 * \note CHEN[3:0]每个位对应一个通道，使用该通道需将该位置1.传输过程中使能位保持为1，
 *       当传输完成次数寄存器DMA_DTCTLx.CNT设置的传输次数后将会自动清零。如果DMA_CTLx.CNT
 *       设置为0，则传输完成后不会自动清零，即无限次传输。
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_disable(amhw_hc32f460_dma_t *p_hw_dma,
                                    uint8_t              channel)
{
    p_hw_dma->CHEN_f.CHEN &= (~(1 << channel));
}


#define HC32F460_AOS_DMA1_TRIGSEL0_BASE    (HC32F460_AOS_BASE + 20UL)
#define HC32F460_AOS_DMA2_TRIGSEL0_BASE    (HC32F460_AOS_BASE + 36UL)

/**
 * \brief DMA TRGSEL[8:0]位选择传输请求的触发源
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] src        : 传输请求设定（hc32f460_dma_chan.h宏定义）
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_trigger_src_set(amhw_hc32f460_dma_t *p_hw_dma,
                                            uint8_t             id,
                                            uint8_t             channel,
                                            en_event_src_t      src)
{
    if (id == 1) {
        *(volatile uint32_t *)((uint32_t)(HC32F460_AOS_DMA1_TRIGSEL0_BASE) + (channel) * 4ul) = src;
    } else if (id == 2){
        *(volatile uint32_t *)((uint32_t)(HC32F460_AOS_DMA2_TRIGSEL0_BASE) + (channel) * 4ul) = src;
    }
}

/**
 * \brief DMA TRGSELRC[8:0]位选择重置请求的触发源
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] src        : 传输请求设定（hc32f460_dma_chan.h宏定义）
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_rcfg_trigger_src_set(en_event_src_t      src)
{
    *(uint32_t *)(0x40010834) = src;
}

/**
 * \brief DMA BLKSIZE[9:0]位指定块的大小
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] num        : 待设值
 *
 * \note 设置数据块的大小，最大可以配置1024个数据。每个数据的宽度由DMA_CHxCTL寄存器的HSIZE位决定。
 *       寄存器值设定位1则每次传输1个数据，设为0则每次传输1024个数据。
 *
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_blksize_set(amhw_hc32f460_dma_t *p_hw_dma,
                                        uint8_t              channel,
                                        uint16_t              size)
{
    *(uint32_t *)(((uint32_t)&(p_hw_dma->DTCTL0)) + (channel * 0x40)) &= (~0x3FF);
    *(uint32_t *)(((uint32_t)&(p_hw_dma->DTCTL0)) + (channel * 0x40)) |= size;
}

/**
 * \brief DMA BLKSIZE[9:0] 获取块的大小
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 *
 * \note 设置数据块的大小，最大可以配置1024个数据。每个数据的宽度由DMA_CHxCTL寄存器的HSIZE位决定。
 *       寄存器值设定位1则每次传输1个数据，设为0则每次传输1024个数据。
 *
 *
 * \return 数据块的大小。
 */
am_static_inline
uint16_t amhw_hc32f460_dma_chan_blksize_get(amhw_hc32f460_dma_t *p_hw_dma,
                                            uint8_t              channel)
{
    return *(uint32_t *)((uint32_t)(&(p_hw_dma->DTCTL0)) + (channel * 0x40)) & (0x3FF);
}

