zlgopen/ametal/soc/hdsc/drivers/include/dma/hw/amhw_hc32f460_dma.h
/**
 * \brief DMA CNT[15:0] 位用于指定总的传输次数。
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] num        : 待设值(最大65535)
 *
 * \note 每次请求启动一个数据块的传输，完成时传输次数减1，当减到0时发生传输完成中断。如果设置为0，
 *       表示无线次传输，每次启动请求传输一个数据块，完成时传输次数保持0不变，不会产出传输完成中断。
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_tran_data_num_set (amhw_hc32f460_dma_t *p_hw_dma,
                                               uint8_t              channel,
                                               uint16_t             num)
{
    *(uint32_t *)((uint32_t)(&(p_hw_dma->DTCTL0)) + (channel * 0x40)) &= (~0xFFFF0000);
    *(uint32_t *)((uint32_t)(&(p_hw_dma->DTCTL0)) + (channel * 0x40)) |= (num << 16);

}

/**
 * \brief DMA CNT[15:0] 位用于指定块的传输次数。     获取
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 *
 * \note
 *
 * \return 当前传输剩余的次数。
 */
am_static_inline
uint16_t amhw_hc32f460_dma_chan_tran_data_num_get (amhw_hc32f460_dma_t *p_hw_dma,
                                                   uint8_t              channel)
{
    return (*(uint32_t *)((uint32_t)(&(p_hw_dma->DTCTL0)) + (channel * 0x40)) >> 16);
}


/**
 * \brief DMA CHxCTL[9:8] 位用于设置传输数据的宽度
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] hsize      : 数据宽度(枚举amhw_hc32f460_dma_chan_data_hsize)
 *                         00: 8bit
 *                         01: 16bit
 *                         10,11: 32bit
 *
 * \note
 */
am_static_inline
void amhw_hc32f460_dma_chan_data_hsize_set (amhw_hc32f460_dma_t *p_hw_dma,
                                            uint8_t              channel,
                                            uint8_t              hsize)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) &= (~(0x3 << 8));
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) |= (hsize << 8);
}

/**
 * \brief DMA CHxCTL[9:8] 获取设置传输数据的宽度
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] hsize      : 数据宽度(枚举amhw_hc32f460_dma_chan_data_hsize)
 *                         00: 8bit
 *                         01: 16bit
 *                         10,11: 32bit
 *
 * \note
 */
am_static_inline
uint8_t amhw_hc32f460_dma_chan_data_hsize_get (amhw_hc32f460_dma_t *p_hw_dma,
                                               uint8_t              channel)
{
    return (*(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) & (0x3 << 8)) >> 8;
}

/**
 * \brief DMA CHxCTL[3:2] 位用于设置对应通道目标地址的更新方式
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] method     : 更新方式
 *
 * \note
 */
am_static_inline
void amhw_hc32f460_dma_chan_srcaddr_update_set (amhw_hc32f460_dma_t *p_hw_dma,
                                                uint8_t              channel,
                                                uint8_t              method)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) &= (~(0x3 << 2));
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) |= (method << 2);
}

/**
 * \brief DMA CHxCTL[3:2] 位用于设置对应通道源地址的更新方式
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] method     : 更新方式
 *
 * \note
 */
am_static_inline
void amhw_hc32f460_dma_chan_dstaddr_update_set (amhw_hc32f460_dma_t *p_hw_dma,
                                                uint8_t              channel,
                                                uint8_t              method)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) &= (~(0x3 << 0));
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) |= (method << 0);
}


#define  AMHW_HC32F460_DMA_CHAN_CFG_INT_ENABLE      (1UL << 12) /**< \brief 使能该通道中断 */
#define  AMHW_HC32F460_DMA_CHAN_CFG_INT_DISABLE     (1UL << 12) /**< \brief 禁能该通道中断 */

#define  AMHW_HC32F460_DMA_CHAN_CFG_LLPRUN_ENABLE   (1 << 11)   /**< \brief 连锁传输模式下，新描述符载入后，立即开始传输 */
#define  AMHW_HC32F460_DMA_CHAN_CFG_LLPRUN_DISABLE  (0 << 11)   /**< \brief 连锁传输模式下，新描述符载入后，等下一个传输请求产生后开始传输 */

#define  AMHW_HC32F460_DMA_CHAN_CFG_LLP_ENABLE      (1 << 10)   /**< \brief 连锁传输使能 */
#define  AMHW_HC32F460_DMA_CHAN_CFG_LLP_DISABLE     (0 << 10)   /**< \brief 连锁传输禁能 */

#define  AMHW_HC32F460_DMA_CHAN_CFG_SIZE_8BIT       (0UL << 8)  /**< \brief 数据宽度 8bit */
#define  AMHW_HC32F460_DMA_CHAN_CFG_SIZE_16BIT      (1UL << 8)  /**< \brief 数据宽度 16bit */
#define  AMHW_HC32F460_DMA_CHAN_CFG_SIZE_32BIT      (2UL << 8)  /**< \brief 数据宽度 32bit */

#define  AMHW_HC32F460_DMA_CHAN_CFG_DSTADD_NOTSEQ_ENABLE  (1UL << 7) /**< \brief 目标地址不连续传输使能 */
#define  AMHW_HC32F460_DMA_CHAN_CFG_DSTADD_NOTSEQ_DISABLE (0UL << 7) /**< \brief 目标地址不连续传输禁能 */

#define  AMHW_HC32F460_DMA_CHAN_CFG_SRCADD_NOTSEQ_ENABLE  (1UL << 6) /**< \brief 源地址不连续传输使能 */
#define  AMHW_HC32F460_DMA_CHAN_CFG_SRCADD_NOTSEQ_DISABLE (0UL << 6) /**< \brief 源地址不连续传输禁能 */

#define  AMHW_HC32F460_DMA_CHAN_CFG_DST_DRPT_ENABLE  (1UL << 5) /**< \brief 目标重复传输功能使能 */
#define  AMHW_HC32F460_DMA_CHAN_CFG_DST_DRPT_DISABLE (0UL << 5) /**< \brief 目标重复传输功能禁能 */

#define  AMHW_HC32F460_DMA_CHAN_CFG_SRC_DRPT_ENABLE  (1UL << 4) /**< \brief 源重复传输功能使能 */
#define  AMHW_HC32F460_DMA_CHAN_CFG_SRC_DRPT_DISABLE (0UL << 4) /**< \brief 源重复传输功能禁能 */

#define  AMHW_HC32F460_DMA_CHAN_DST_ADD_FIXED      (0UL << 2) /**< \brief 目标地址固定 */
#define  AMHW_HC32F460_DMA_CHAN_DST_ADD_INCREASING (1UL << 2) /**< \brief 目标地址递增 */
#define  AMHW_HC32F460_DMA_CHAN_DST_ADD_DECREASING (2UL << 2) /**< \brief 目标地址递减 */

#define  AMHW_HC32F460_DMA_CHAN_SRC_ADD_FIXED      (0UL << 0) /**< \brief 源地址固定 */
#define  AMHW_HC32F460_DMA_CHAN_SRC_ADD_INCREASING (1UL << 0) /**< \brief 源地址递增 */
#define  AMHW_HC32F460_DMA_CHAN_SRC_ADD_DECREASING (2UL << 0) /**< \brief 源地址递减 */
/**
 * \brief DMA 通道控制寄存器设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] flag       : 设置标志
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_config_set(amhw_hc32f460_dma_t *p_hw_dma,
                                       uint8_t              channel,
                                       uint32_t             flag)

{
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) = flag;
}


#define  AMHW_HC32F460_DMA_CHAN_INT_ERR      (1UL << 20) /**< \brief 未完成中断  */
#define  AMHW_HC32F460_DMA_CHAN_INT_TX_CMP   (1UL << 19) /**< \brief 完成中断 */

/**
 * \brief DMA 中断状态
 *@{
 */
typedef enum {
    AMHW_HC32F460_DMA_INT_FLAG_DEFAULT         = 0,         /**< \brief 初始默认值 */
    AMHW_HC32F460_DMA_INT_FLAG_ERR_REQ_ERR     = (1 << 0),  /**< \brief 传输请求溢出错误中断 */
    AMHW_HC32F460_DMA_INT_FLAG_ERR_TRNERR      = (1 << 1),  /**< \brief 传输错误中断 */
    AMHW_HC32F460_DMA_INT_FLAG_BLK_TX_COMPLETE = (1 << 2),  /**< \brief 块传输完成中断 */
    AMHW_HC32F460_DMA_INT_FLAG_TX_COMPLETE     = (1 << 3),  /**< \brief 传输完成中断*/
}amhw_hc32f460_dma_int_flag_t;
/**
 * \brief DMA 某一通道中断使能
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_int_enable(amhw_hc32f460_dma_t *p_hw_dma,
                                       uint8_t              channel)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) |= (1 << 12);
}

/**
 * \brief DMA 某一通道中断禁能
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_int_disable(amhw_hc32f460_dma_t *p_hw_dma,
                                        uint8_t              channel)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->CH0CTL) + (channel * 0x40)) &= (~(1 << 12));
}

/**
 * \brief 设置中断屏蔽寄存器
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] chan       : 通道号
 * \param[in] flag       : 中断编号
 *
 * \note

