zlgopen/ametal/soc/hdsc/drivers/include/dma/hw/amhw_hc32f460_dma.h
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_int_mask_set(amhw_hc32f460_dma_t *p_hw_dma,
                                    uint8_t              chan,
                                    uint32_t             flag)
{
    if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_REQ_ERR) {
        p_hw_dma->INTMASK0_f.MSKREQERR |= (1 << chan);
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_TRNERR) {
        p_hw_dma->INTMASK0_f.MSKTRNERR |= (1 << chan);
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_BLK_TX_COMPLETE) {
        p_hw_dma->INTMASK1_f.MSKBTC    |= (1 << chan);
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_TX_COMPLETE) {
        p_hw_dma->INTMASK1_f.MSKTC     |= (1 << chan);
    }
}

/**
 * \brief 清除中断屏蔽寄存器
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] chan       : 通道号
 * \param[in] flag       : 中断编号
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_int_mask_clr(amhw_hc32f460_dma_t *p_hw_dma,
                                    uint8_t              chan,
                                    uint32_t             flag)
{
    if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_REQ_ERR) {
        p_hw_dma->INTMASK0_f.MSKREQERR &= (~(1 << chan));
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_TRNERR) {
        p_hw_dma->INTMASK0_f.MSKTRNERR &= (~(1 << chan));
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_BLK_TX_COMPLETE) {
        p_hw_dma->INTMASK1_f.MSKBTC    &= (~(1 << chan));
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_TX_COMPLETE) {
        p_hw_dma->INTMASK1_f.MSKTC     &= (~(1 << chan));
    }
}


/**
 * \brief 中断状态标志获取
 *
 * \param[in] p_hw_dma : 指向DMA寄存器结构体的指针
 * \param[in] channel  : 通道号
 * \param[in] flag     : 状态标志
 *
 * \return AM_TRUE or AM_FALSE
 */
am_static_inline
am_bool_t amhw_hc32f460_dma_chan_stat_check (amhw_hc32f460_dma_t         *p_hw_dma,
                                             uint8_t                      channel,
                                             amhw_hc32f460_dma_int_flag_t flag)
{
    if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_REQ_ERR) {
        return (((p_hw_dma->INTSTAT0 >> 16) & (1 << channel)) ? AM_TRUE: AM_FALSE);
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_TRNERR) {
        return (((p_hw_dma->INTSTAT0 >> 0) & (1 << channel)) ? AM_TRUE: AM_FALSE);
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_BLK_TX_COMPLETE) {
        return (((p_hw_dma->INTSTAT1 >> 16) & (1 << channel)) ? AM_TRUE: AM_FALSE);
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_TX_COMPLETE) {
        return (((p_hw_dma->INTSTAT1 >> 0) & (1 << channel)) ? AM_TRUE: AM_FALSE);
    } else {
        return -AM_EINVAL;
    }
}

/**
 * \brief 中断状态标志清除
 *
 * \param[in] p_hw_dma    : 指向DMA寄存器结构体的指针
 * \param[in] channel     : 通道号
 * \param[in] flag        : 状态标志
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_flag_clear (amhw_hc32f460_dma_t         *p_hw_dma,
                                        uint8_t                      channel,
                                        amhw_hc32f460_dma_int_flag_t flag)
{
    if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_REQ_ERR) {
        p_hw_dma->INTCLR0 |= (1 << (16 + channel));
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_ERR_TRNERR) {
        p_hw_dma->INTCLR0 |= (1 << (0 + channel));
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_BLK_TX_COMPLETE) {
        p_hw_dma->INTCLR1 |= (1 << (16 + channel));
    } else if (flag == AMHW_HC32F460_DMA_INT_FLAG_TX_COMPLETE) {
        p_hw_dma->INTCLR1 |= (1 << (0 + channel));
    }
}

/**
 * \brief 源地址设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] address    : 地址
 *
 * \note
 *
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_src_address_set(amhw_hc32f460_dma_t *p_hw_dma,
                                            uint8_t            channel,
                                            uint32_t           address)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->SAR0) + (channel * 0x40)) =  address;
}

/**
 * \brief 目标地址设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] address    : 地址
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_dst_address_set(amhw_hc32f460_dma_t *p_hw_dma,
                                            uint8_t              channel,
                                            uint32_t             address)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->DAR0) + (channel * 0x40)) =  address;
}

/**
 * \brief DMA数据控制寄存器设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] cfg        : 设置值
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_dtctl_set(amhw_hc32f460_dma_t *p_hw_dma,
                                      uint8_t              channel,
                                      uint32_t             cfg)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->DTCTL0) + (channel * 0x40)) =  cfg;
}

/**
 * \brief DMA重复区域寄存器设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] cfg        : 设置值
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_rpt_set(amhw_hc32f460_dma_t *p_hw_dma,
                                    uint8_t              channel,
                                    uint32_t             cfg)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->RPT0) + (channel * 0x40)) =  cfg;
}

/**
 * \brief DMA目标地址重复区域大小设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] size       : 目标地址重复区域大小（以数据个数为单位）
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_drpt_set(amhw_hc32f460_dma_t *p_hw_dma,
                                     uint8_t              channel,
                                     uint32_t             size)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->RPT0) + (channel * 0x40)) &= (~(0x3FF << 16));
    *(uint32_t *)((uint32_t)&(p_hw_dma->RPT0) + (channel * 0x40)) |= (size << 16);
}

/**
 * \brief DMA源地址重复区域大小设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] size       : 源地址重复区域大小（以数据个数为单位）
 *
 * \note

