zlgopen/ametal/soc/hdsc/drivers/include/dma/hw/amhw_hc32f460_dma.h
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_srpt_set(amhw_hc32f460_dma_t *p_hw_dma,
                                     uint8_t              channel,
                                     uint32_t             size)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->RPT0) + (channel * 0x40)) &= (~0x3FF);
    *(uint32_t *)((uint32_t)&(p_hw_dma->RPT0) + (channel * 0x40)) |= size;
}

/**
 * \brief DMA源设备不连续地址传输控制寄存器设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] cfg        : 设置值
 *
 * \note
 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_snseqctl_set(amhw_hc32f460_dma_t *p_hw_dma,
                                         uint8_t              channel,
                                         uint32_t             cfg)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->SNSEQCTL0) + (channel * 0x40)) =  cfg;
}

/**
 * \brief DMA目标设备不连续地址传输控制寄存器设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] cfg        : 设置值
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_dnseqctl_set(amhw_hc32f460_dma_t *p_hw_dma,
                                         uint8_t              channel,
                                         uint32_t             cfg)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->DNSEQCTL0) + (channel * 0x40)) =  cfg;
}

/**
 * \brief DMA链指针寄存器设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] cfg        : 设置值
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_llp_set(amhw_hc32f460_dma_t *p_hw_dma,
                                    uint8_t              channel,
                                    uint32_t             cfg)
{
    *(uint32_t *)((uint32_t)&(p_hw_dma->LLP0) + (channel * 0x40)) =  cfg;
}

/**
 * \brief DMA通道重置控制寄存器设置
 *
 * \param[in] p_hw_dma   : 指向DMA寄存器结构体的指针
 * \param[in] channel    : 通道号
 * \param[in] cfg        : 设置值
 *
 * \note

 * \return none
 */
am_static_inline
void amhw_hc32f460_dma_chan_rcfg_set(amhw_hc32f460_dma_t *p_hw_dma, uint32_t flag)
{
    p_hw_dma->RCFGCTL = flag;
}




/**
 * @} amhw_if_hc32f460_dma
 */

#ifdef __cplusplus
}
#endif

#endif  /* __AMHW_HC32F460_DMA_H */

/* end of file */
